app/assigenQuery.php

update `inventories` set `assigned_by` = '6' where `serial_code` = '1005'
---
public static function assigenDB($id,$code){
  if (user_quiers::getMangerById($id) &&
      inven_quires::getInvenByCode($code)){
     DB::table('inventories')
         ->where('serial_code', $code)
         ->update(['assigned_by' => $id]);