app/counters.php

select count(*) as count from `users` where `role_id` = 10
---
     private static function countAdmins(){
       $num=DB::table('users')->select(DB::raw('count(*) as count'))
                       ->where('role_id', 10)->get();

select count(*) as count from `users` where `role_id` = 20
---
     private static function countInventoryManger(){
       $num=DB::table('users')->select(DB::raw('count(*) as count'))
                       ->where('role_id', 20)->get();

select count(*) as aggregate from `inventories`
---
    private  static function countInventories(){
      return DB::table('inventories')->count();

select * from `users` where `id` between 1 and 5
---
    private  static function getUsers($start=1,$end=5){
      $results = DB::table('users')
           ->whereBetween('id', [$start,$end])
           ->get();

select * from `inventories` where `id` between 1 and 5
---
        private  static function getinven($start=1,$end=5){
          $results = DB::table('inventories')
               ->whereBetween('id', [$start,$end])
               ->get();