app/inven_quires.php

insert into `inventories` (`serial_code`, `storage`, `country`, `city`, `street`, `user_id`) values ('1005', '15899', 'London', 'zikwer', '10 square industry area', 3)
---
     public static function insert($inputs){
       $inventory=[
         'serial_code'=>request('serial_code'),
         'storage'=>request('storage'),
         'country'=>request('country'),
         'city'=>request('city'),
         'street'=>request('street'),
         'user_id'=> Auth::id()
       ];
       DB::table('inventories')->insert($inventory);

update `inventories` set `serial_code` = '2020', `storage` = '1000', `country` = 'Egypt', `city` = 'cairo', `street` = 'elmiaz20' where `id` = 1
---
    public static function updateinv($inv,$id){
      //dd($id);
      DB::table('inventories')
           ->where('id',$id)
           ->update($inv);