app/user_quiers.php

insert into `users` (`name`, `email`, `phone`, `address`, `hashed_password`, `role_id`) values ('mohamed Ahmed', 'mohamed@yahoo.com', '01042517858', 'el asher', 'y$K.KBuhFFXanFKWAr8/VaU.CUHwP451LTPo/mpB8t43/GYQeT58z5O', '10')
---
     public static function insert($inputs){
       $user=[
         'name'=>$inputs['name'],
         'email'=>$inputs['email'],
         'phone'=>$inputs['phone'],
         'address'=>$inputs['address'],
         'hashed_password'=>Hash::make($inputs['password']),
         'role_id'=>$inputs['role_id']
       ];
       DB::table('users')->insert($user);

delete from `users` where `id` = 6
---
 public static function deleteUser($user){
   DB::table('users')->where('id',$user->id)->delete();

update `users` set `name` = 'soha Ahmed', `email` = 'soha121@gmail.com', `phone` = '01045121044', `address` = 'maka-sudia', `role_id` = '20' where `id` is null
---
     public static function updateUser($user,$id){
       //dd($id);
       DB::table('users')
            ->where('id',$id)
            ->update($user);